dasdasd12/hardware/firmware/h417/v5f_rtthread/rt-thread/components/drivers/usb/cherryusb/port/ch32h417/usb_dc_ch32h417_usbfs.c
/*
 * Copyright (c) 2026
 *
 * SPDX-License-Identifier: Apache-2.0
 */
#include "usb_dc_ch32h417_usbfs.h"

#include <rtthread.h>
#include <string.h>

#include "board.h"
#include "ch32h417.h"

#define USBFS_INIT_TIMEOUT     1000000U
#define USBFS_EP_BUFFER_SIZE   64U

#ifndef USBFS_ENABLE_SUSPEND_IRQ
#define USBFS_ENABLE_SUSPEND_IRQ 1
#endif

#define USBFS_UEP_DMA_BASE     ((uintptr_t)USBFS_BASE + 0x10U)
#define USBFS_UEP_LEN_BASE     ((uintptr_t)USBFS_BASE + 0x30U)
#define USBFS_UEP_CTL_BASE     ((uintptr_t)USBFS_BASE + 0x32U)
#define USBFS_IRQ_WORD(irqn)    ((uint32_t)(irqn) >> 5U)
#define USBFS_IRQ_MASK(irqn)    (1UL << ((uint32_t)(irqn) & 0x1FU))
#define USBFS_CFGR2_MASK        (RCC_USBFSSRC | RCC_USBFSDIV)
#define USBFS_CFGR2_48M         (RCC_USBFSSRC_USBHSPLL | RCC_USBFSDIV_DIV10)
#define USBFS_DMA_RAM_BASE      ((uintptr_t)0x20178200U)
#define USBFS_DMA_RAM_SIZE      (USB_CH32H417_FS_EP0_MPS + (USB_CH32H417_MAX_EP_NUM * USBFS_EP_BUFFER_SIZE * 2U))

#ifndef APP_USBFS_STREAM_DIAG
#define APP_USBFS_STREAM_DIAG 0
#endif

#if APP_USBFS_STREAM_DIAG
#define USBFS_IRQ_PRIORITY 0x00U
#else
#define USBFS_IRQ_PRIORITY 1U
#endif

struct usb_dc_ep_state {
    uint16_t ep_mps;
    uint8_t ep_type;
    uint8_t ep_stalled;
    uint8_t ep_enabled;
    uint8_t ep_toggle;
    uint8_t *xfer_buf;
    uint32_t xfer_len;
    uint32_t actual_xfer_len;
};

struct ch32h417_usbfs_udc {
    volatile uint8_t dev_addr;
    uint8_t addr_pending;
    uint8_t port_speed;
    struct usb_dc_ep_state in_ep[USB_CH32H417_MAX_EP_NUM];
    struct usb_dc_ep_state out_ep[USB_CH32H417_MAX_EP_NUM];
};

struct ch32h417_usbfs_diag {
    volatile uint32_t irq;
    volatile uint32_t bus_reset;
    volatile uint32_t suspend;
    volatile uint32_t resume;
    volatile uint32_t wakeup_irq;
    volatile uint32_t transfer;
    volatile uint32_t transfer_nak;
    volatile uint32_t transfer_bad_ep;
    volatile uint32_t setup;
    volatile uint32_t setup_recovered;
    volatile uint32_t ep0_prime_in;
    volatile uint32_t ep0_in;
    volatile uint32_t ep0_prime_out;
    volatile uint32_t ep0_out;
    volatile uint32_t set_addr;
    volatile uint32_t stall;
    volatile uint32_t last_setup0;
    volatile uint32_t last_setup1;
    volatile uint32_t last_resp0;
    volatile uint32_t last_intflag;
    volatile uint32_t last_intst;
    volatile uint32_t last_xfer_intflag;
    volatile uint32_t last_xfer_intst;
    volatile uint32_t last_xfer_ep;
    volatile uint32_t last_xfer_token;
    volatile uint32_t last_xfer_rx_len;
    volatile uint32_t last_xfer_buf0;
    volatile uint32_t last_xfer_buf1;
    volatile uint32_t last_tx_len;
    volatile uint32_t last_rx_len;
    volatile uint32_t last_addr;
};

static struct ch32h417_usbfs_udc g_ch32h417_usbfs_udc;
static struct ch32h417_usbfs_diag g_ch32h417_usbfs_diag;

#if APP_USBFS_STREAM_DIAG
extern volatile rt_atomic_t rt_interrupt_nest;
extern void (*rt_interrupt_leave_hook)(void);

static volatile struct ch32h417_usbfs_retain_trace *const usbfs_retain_trace =
    (volatile struct ch32h417_usbfs_retain_trace *)(uintptr_t)
        CH32H417_USBFS_RETAIN_TRACE_ADDR;

static __attribute__((always_inline)) inline uint32_t usbfs_read_sp(void)
{
    uint32_t value;
    __asm volatile("mv %0, sp" : "=r"(value));
    return value;
}

static __attribute__((always_inline)) inline uint32_t usbfs_read_mscratch(void)
{
    uint32_t value;
    __asm volatile("csrr %0, mscratch" : "=r"(value));
    return value;
}

static __attribute__((always_inline)) inline uint32_t usbfs_read_mstatus(void)
{
    uint32_t value;
    __asm volatile("csrr %0, mstatus" : "=r"(value));
    return value;
}

static __attribute__((always_inline)) inline uint32_t usbfs_read_gp(void)
{
    uint32_t value;
    __asm volatile("mv %0, gp" : "=r"(value));
    return value;
}

static __attribute__((always_inline)) inline void usbfs_trace_mark(
    uint32_t stage, uint32_t progress)
{
    usbfs_retain_trace->magic = CH32H417_USBFS_RETAIN_TRACE_MAGIC;
    usbfs_retain_trace->version = CH32H417_USBFS_RETAIN_TRACE_VERSION;
    usbfs_retain_trace->irq_state =
        (uint32_t)USBFSD->INT_FG |
        ((uint32_t)USBFSD->INT_ST << 8U) |
        ((uint32_t)USBFSD->RX_LEN << 16U);
    usbfs_retain_trace->ep_state =
        (uint32_t)USBFSD->UEP2_RX_CTRL |
        ((uint32_t)USBFSD->BASE_CTRL << 8U) |
        ((uint32_t)USBFSD->INT_EN << 16U);
    usbfs_retain_trace->progress = progress;
    usbfs_retain_trace->sp = usbfs_read_sp();
    usbfs_retain_trace->mscratch = usbfs_read_mscratch();
    usbfs_retain_trace->mstatus = usbfs_read_mstatus();
    usbfs_retain_trace->transfer_count = g_ch32h417_usbfs_diag.transfer;
    usbfs_retain_trace->nak_count = g_ch32h417_usbfs_diag.transfer_nak;
    usbfs_retain_trace->interrupt_nest = (uint32_t)rt_interrupt_nest;
    usbfs_retain_trace->leave_hook =
        (uint32_t)(uintptr_t)rt_interrupt_leave_hook;
    usbfs_retain_trace->gp = usbfs_read_gp();
    __asm volatile("fence rw, rw" ::: "memory");
    /* Commit stage last so it describes a fully written snapshot. */
    usbfs_retain_trace->stage = stage;
    __asm volatile("fence rw, rw" ::: "memory");
}

static __attribute__((always_inline)) inline void usbfs_trace_irq_begin(void)
{
    if ((usbfs_retain_trace->magic != CH32H417_USBFS_RETAIN_TRACE_MAGIC) ||
        (usbfs_retain_trace->version != CH32H417_USBFS_RETAIN_TRACE_VERSION)) {
        usbfs_retain_trace->sequence = 0U;
    }
    usbfs_retain_trace->sequence++;
    usbfs_trace_mark(CH32H417_USBFS_TRACE_IRQ_ENTER, 0U);
}

static __attribute__((always_inline)) inline void usbfs_rt_interrupt_leave_traced(void)
{
    uint32_t level;

    usbfs_trace_mark(CH32H417_USBFS_TRACE_RT_LEAVE_BEGIN,
                     (uint32_t)rt_interrupt_nest);
    /* Inline the four operations performed by the weak RT-Thread leave. */
    __asm volatile("csrrci %0, mstatus, 8" : "=r"(level) :: "memory");
    usbfs_trace_mark(CH32H417_USBFS_TRACE_RT_LEAVE_IRQ_OFF, level);
    if (rt_interrupt_nest != 0) {
        rt_interrupt_nest--;
    }
    usbfs_trace_mark(CH32H417_USBFS_TRACE_RT_LEAVE_NEST_DEC,
                     (uint32_t)rt_interrupt_nest);
    __asm volatile("csrw mstatus, %0" :: "r"(level) : "memory");
    usbfs_trace_mark(CH32H417_USBFS_TRACE_RT_LEAVE_END,
                     (uint32_t)rt_interrupt_nest);
}
#else
#define usbfs_trace_mark(stage, progress) ((void)0)
#define usbfs_trace_irq_begin() ((void)0)
#endif

static uint8_t *const usbfs_ep0_buffer = (uint8_t *)USBFS_DMA_RAM_BASE;
static uint8_t (*const usbfs_ep_tx_buffer)[USBFS_EP_BUFFER_SIZE] =
    (uint8_t (*)[USBFS_EP_BUFFER_SIZE])(USBFS_DMA_RAM_BASE + USB_CH32H417_FS_EP0_MPS);
static uint8_t (*const usbfs_ep_rx_buffer)[USBFS_EP_BUFFER_SIZE] =
    (uint8_t (*)[USBFS_EP_BUFFER_SIZE])(USBFS_DMA_RAM_BASE + USB_CH32H417_FS_EP0_MPS +
                                        (USB_CH32H417_MAX_EP_NUM * USBFS_EP_BUFFER_SIZE));

static inline __IO uint32_t *usbfs_ep_dma_reg(uint8_t ep_idx)
{
    return (__IO uint32_t *)(USBFS_UEP_DMA_BASE + ((uintptr_t)ep_idx * 4U));
}

static inline __IO uint16_t *usbfs_ep_tx_len_reg(uint8_t ep_idx)
{
    return (__IO uint16_t *)(USBFS_UEP_LEN_BASE + ((uintptr_t)ep_idx * 4U));
}

static inline __IO uint8_t *usbfs_ep_tx_ctrl_reg(uint8_t ep_idx)
{
    return (__IO uint8_t *)(USBFS_UEP_CTL_BASE + ((uintptr_t)ep_idx * 4U));
}

static inline __IO uint8_t *usbfs_ep_rx_ctrl_reg(uint8_t ep_idx)
{
    return (__IO uint8_t *)(USBFS_UEP_CTL_BASE + ((uintptr_t)ep_idx * 4U) + 1U);
}

static void usbfs_delay(uint32_t cycles)
{
    volatile uint32_t i;

    for (i = 0U; i < cycles; i++) {
        __NOP();
    }
}

static uint32_t usbfs_irq_is_enabled(IRQn_Type irq)
{
    uint32_t word = USBFS_IRQ_WORD(irq);

    if (word >= 8U) {
        return 0U;
    }

