dasdasd12/hardware/firmware/h417/v5f_rtthread/rt-thread/components/drivers/usb/cherryusb/port/ch32h417/usb_dc_ch32h417_usbfs.c
    return (NVIC->ISR[word] & USBFS_IRQ_MASK(irq)) != 0U;
}

static uint32_t usbfs_irq_is_pending(IRQn_Type irq)
{
    uint32_t word = USBFS_IRQ_WORD(irq);

    if (word >= 8U) {
        return 0U;
    }

    return (NVIC->IPR[word] & USBFS_IRQ_MASK(irq)) != 0U;
}

static uint32_t usbfs_irq_is_active(IRQn_Type irq)
{
    uint32_t word = USBFS_IRQ_WORD(irq);

    if (word >= 8U) {
        return 0U;
    }

    return (NVIC->IACTR[word] & USBFS_IRQ_MASK(irq)) != 0U;
}

static uint32_t usbfs_pack4(const uint8_t *data)
{
    if (data == RT_NULL) {
        return 0U;
    }

    return ((uint32_t)data[0]) |
           ((uint32_t)data[1] << 8) |
           ((uint32_t)data[2] << 16) |
           ((uint32_t)data[3] << 24);
}

static uint8_t usbfs_ep0_buffer_has_setup(void)
{
    uint8_t request_type = usbfs_ep0_buffer[0];
    uint8_t request = usbfs_ep0_buffer[1];
    uint16_t length = (uint16_t)usbfs_ep0_buffer[6] | ((uint16_t)usbfs_ep0_buffer[7] << 8);

    if (((request_type & USB_REQUEST_TYPE_MASK) == USB_REQUEST_RESERVED) ||
        ((request_type & 0x1fU) > USB_REQUEST_RECIPIENT_OTHER)) {
        return 0U;
    }

    if (((request_type & USB_REQUEST_TYPE_MASK) == USB_REQUEST_STANDARD) &&
        (request > USB_REQUEST_SYNCH_FRAME)) {
        return 0U;
    }

    if ((request_type == 0U) && (request == 0U) &&
        (usbfs_ep0_buffer[2] == 0U) && (usbfs_ep0_buffer[3] == 0U) &&
        (usbfs_ep0_buffer[4] == 0U) && (usbfs_ep0_buffer[5] == 0U) &&
        (length == 0U)) {
        return 0U;
    }

    return 1U;
}

static void usbfs_ep_mod_update(uint8_t ep_idx, uint8_t is_in, uint8_t enable)
{
    __IO uint8_t *mod_reg = RT_NULL;
    uint8_t mask = 0U;

    switch (ep_idx) {
    case 1U:
        mod_reg = &USBFSD->UEP4_1_MOD;
        mask = is_in ? USBFS_UEP1_TX_EN : USBFS_UEP1_RX_EN;
        break;
    case 2U:
        mod_reg = &USBFSD->UEP2_3_MOD;
        mask = is_in ? USBFS_UEP2_TX_EN : USBFS_UEP2_RX_EN;
        break;
    case 3U:
        mod_reg = &USBFSD->UEP2_3_MOD;
        mask = is_in ? USBFS_UEP3_TX_EN : USBFS_UEP3_RX_EN;
        break;
    case 4U:
        mod_reg = &USBFSD->UEP4_1_MOD;
        mask = is_in ? USBFS_UEP4_TX_EN : USBFS_UEP4_RX_EN;
        break;
    case 5U:
        mod_reg = &USBFSD->UEP5_6_MOD;
        mask = is_in ? USBFS_UEP5_TX_EN : USBFS_UEP5_RX_EN;
        break;
    case 6U:
        mod_reg = &USBFSD->UEP5_6_MOD;
        mask = is_in ? USBFS_UEP6_TX_EN : USBFS_UEP6_RX_EN;
        break;
    case 7U:
        mod_reg = &USBFSD->UEP7_MOD;
        mask = is_in ? USBFS_UEP7_TX_EN : USBFS_UEP7_RX_EN;
        break;
    default:
        break;
    }

    if (mod_reg == RT_NULL) {
        return;
    }

    if (enable != 0U) {
        *mod_reg |= mask;
    } else {
        *mod_reg &= (uint8_t)~mask;
    }
}

static void usbfs_ep0_state_init(void)
{
    g_ch32h417_usbfs_udc.out_ep[0].ep_mps = USB_CH32H417_FS_EP0_MPS;
    g_ch32h417_usbfs_udc.out_ep[0].ep_type = USB_ENDPOINT_TYPE_CONTROL;
    g_ch32h417_usbfs_udc.out_ep[0].ep_enabled = 1U;
    g_ch32h417_usbfs_udc.out_ep[0].ep_toggle = 0U;
    g_ch32h417_usbfs_udc.out_ep[0].xfer_buf = RT_NULL;
    g_ch32h417_usbfs_udc.out_ep[0].xfer_len = 0U;
    g_ch32h417_usbfs_udc.out_ep[0].actual_xfer_len = 0U;
    g_ch32h417_usbfs_udc.out_ep[0].ep_stalled = 0U;

    g_ch32h417_usbfs_udc.in_ep[0].ep_mps = USB_CH32H417_FS_EP0_MPS;
    g_ch32h417_usbfs_udc.in_ep[0].ep_type = USB_ENDPOINT_TYPE_CONTROL;
    g_ch32h417_usbfs_udc.in_ep[0].ep_enabled = 1U;
    g_ch32h417_usbfs_udc.in_ep[0].ep_toggle = 0U;
    g_ch32h417_usbfs_udc.in_ep[0].xfer_buf = RT_NULL;
    g_ch32h417_usbfs_udc.in_ep[0].xfer_len = 0U;
    g_ch32h417_usbfs_udc.in_ep[0].actual_xfer_len = 0U;
    g_ch32h417_usbfs_udc.in_ep[0].ep_stalled = 0U;

    USBFSD->UEP0_DMA = (uint32_t)usbfs_ep0_buffer;
    USBFSD->UEP0_TX_LEN = 0U;
    USBFSD->UEP0_RX_CTRL = USBFS_UEP_R_RES_ACK;
    USBFSD->UEP0_TX_CTRL = USBFS_UEP_T_RES_NAK;
}

static void usbfs_clear_transfer_state(void)
{
    memset(&g_ch32h417_usbfs_udc, 0, sizeof(g_ch32h417_usbfs_udc));
    g_ch32h417_usbfs_udc.port_speed = USB_SPEED_FULL;
    usbfs_ep0_state_init();
}

static void usbfs_apply_pending_address(void)
{
    if (g_ch32h417_usbfs_udc.addr_pending != 0U) {
        USBFSD->DEV_ADDR = (uint8_t)((USBFSD->DEV_ADDR & USBFS_UDA_GP_BIT) |
                                     (g_ch32h417_usbfs_udc.dev_addr & USBFS_USB_ADDR_MASK));
        g_ch32h417_usbfs_udc.addr_pending = 0U;
    }
}

static void usbfs_ep_prime_in(uint8_t ep_idx, const uint8_t *data, uint32_t data_len)
{
    uint32_t mps = (uint32_t)g_ch32h417_usbfs_udc.in_ep[ep_idx].ep_mps;
    uint8_t ctrl;
    uint16_t xfer_len;

    if ((mps == 0U) || (mps > USBFS_EP_BUFFER_SIZE)) {
        mps = (ep_idx == 0U) ? USB_CH32H417_FS_EP0_MPS : USBFS_EP_BUFFER_SIZE;
    }
    if (data_len > mps) {
        data_len = mps;
    }
    xfer_len = (uint16_t)data_len;

    if (ep_idx == 0U) {
        ctrl = (g_ch32h417_usbfs_udc.in_ep[0].ep_toggle != 0U) ? USBFS_UEP_T_TOG : 0U;
        if ((data != RT_NULL) && (data_len != 0U)) {
            memcpy(usbfs_ep0_buffer, data, data_len);
        }
        USBFSD->UEP0_DMA = (uint32_t)usbfs_ep0_buffer;
        USBFSD->UEP0_TX_LEN = (uint8_t)xfer_len;
        USBFSD->UEP0_TX_CTRL = (uint8_t)(ctrl | USBFS_UEP_T_RES_ACK);
        g_ch32h417_usbfs_diag.ep0_prime_in++;
        g_ch32h417_usbfs_diag.last_tx_len = xfer_len;
        g_ch32h417_usbfs_diag.last_resp0 = usbfs_pack4(usbfs_ep0_buffer);
    } else {
        if ((data != RT_NULL) && (data_len != 0U)) {
            memcpy(usbfs_ep_tx_buffer[ep_idx], data, data_len);
        }
        *usbfs_ep_dma_reg(ep_idx) = (uint32_t)usbfs_ep_tx_buffer[ep_idx];
        *usbfs_ep_tx_len_reg(ep_idx) = xfer_len;
        *usbfs_ep_tx_ctrl_reg(ep_idx) =
            (uint8_t)((*usbfs_ep_tx_ctrl_reg(ep_idx) & ~USBFS_UEP_T_RES_MASK) | USBFS_UEP_T_AUTO_TOG | USBFS_UEP_T_RES_ACK);
    }
}

static void usbfs_ep_prime_out(uint8_t ep_idx)
{
    uint8_t ctrl;

    if (ep_idx == 0U) {
        ctrl = (g_ch32h417_usbfs_udc.out_ep[0].ep_toggle != 0U) ? USBFS_UEP_R_TOG : 0U;
        USBFSD->UEP0_DMA = (uint32_t)usbfs_ep0_buffer;
        USBFSD->UEP0_RX_CTRL = (uint8_t)(ctrl | USBFS_UEP_R_RES_ACK);
        g_ch32h417_usbfs_diag.ep0_prime_out++;
    } else {
        *usbfs_ep_dma_reg(ep_idx) = (uint32_t)usbfs_ep_rx_buffer[ep_idx];
        *usbfs_ep_rx_ctrl_reg(ep_idx) =
            (uint8_t)((*usbfs_ep_rx_ctrl_reg(ep_idx) & ~USBFS_UEP_R_RES_MASK) | USBFS_UEP_R_AUTO_TOG | USBFS_UEP_R_RES_ACK);
    }
}

static void usbfs_handle_setup_packet(uint8_t busid)
{
    g_ch32h417_usbfs_diag.setup++;
    g_ch32h417_usbfs_diag.last_setup0 = usbfs_pack4(usbfs_ep0_buffer);
    g_ch32h417_usbfs_diag.last_setup1 = usbfs_pack4(usbfs_ep0_buffer + 4);

    g_ch32h417_usbfs_udc.out_ep[0].ep_toggle = 1U;
    g_ch32h417_usbfs_udc.out_ep[0].actual_xfer_len = 0U;
    g_ch32h417_usbfs_udc.out_ep[0].xfer_len = 0U;
    g_ch32h417_usbfs_udc.out_ep[0].xfer_buf = RT_NULL;
    g_ch32h417_usbfs_udc.in_ep[0].ep_toggle = 1U;
    g_ch32h417_usbfs_udc.in_ep[0].actual_xfer_len = 0U;
    g_ch32h417_usbfs_udc.in_ep[0].xfer_len = 0U;
    g_ch32h417_usbfs_udc.in_ep[0].xfer_buf = RT_NULL;

    USBFSD->UEP0_TX_CTRL = USBFS_UEP_T_TOG | USBFS_UEP_T_RES_NAK;
    USBFSD->UEP0_RX_CTRL = USBFS_UEP_R_TOG | USBFS_UEP_R_RES_NAK;
    usbd_event_ep0_setup_complete_handler(busid, usbfs_ep0_buffer);
}

