dasdasd12/hardware/firmware/h417/v5f_rtthread/rt-thread/components/drivers/usb/cherryusb/port/ch32h417/usb_dc_ch32h417_usbfs.c
static void usbfs_handle_ep_in_xfer_complete(uint8_t busid, uint8_t ep_idx)
{
    struct usb_dc_ep_state *ep = &g_ch32h417_usbfs_udc.in_ep[ep_idx];
    uint32_t sent_len = (ep_idx == 0U) ? USBFSD->UEP0_TX_LEN : *usbfs_ep_tx_len_reg(ep_idx);

    if (sent_len > ep->xfer_len) {
        sent_len = ep->xfer_len;
    }

    ep->actual_xfer_len += sent_len;
    ep->xfer_len -= sent_len;

    if (ep_idx == 0U) {
        g_ch32h417_usbfs_diag.ep0_in++;
        g_ch32h417_usbfs_diag.last_tx_len = sent_len;
        g_ch32h417_usbfs_udc.in_ep[0].ep_toggle ^= 1U;
    }

    if (ep->xfer_len == 0U) {
        if (ep_idx == 0U) {
            usbfs_apply_pending_address();
            usbd_event_ep_in_complete_handler(busid, USB_CONTROL_IN_EP0, ep->actual_xfer_len);
        } else {
            *usbfs_ep_tx_ctrl_reg(ep_idx) =
                (uint8_t)((*usbfs_ep_tx_ctrl_reg(ep_idx) & ~USBFS_UEP_T_RES_MASK) | USBFS_UEP_T_AUTO_TOG | USBFS_UEP_T_RES_NAK);
            usbd_event_ep_in_complete_handler(busid, (uint8_t)(ep_idx | 0x80U), ep->actual_xfer_len);
        }
    } else {
        uint32_t next_len = (ep->xfer_len > ep->ep_mps) ? ep->ep_mps : ep->xfer_len;
        usbfs_ep_prime_in(ep_idx, ep->xfer_buf + ep->actual_xfer_len, next_len);
    }
}

static void usbfs_handle_ep_out_xfer_complete(uint8_t busid, uint8_t ep_idx)
{
    struct usb_dc_ep_state *ep = &g_ch32h417_usbfs_udc.out_ep[ep_idx];
    uint32_t rx_len = USBFSD->RX_LEN;

    usbfs_trace_mark(CH32H417_USBFS_TRACE_OUT_ENTER,
                     ((uint32_t)ep_idx << 24U) |
                     (ep->actual_xfer_len & 0x00FFFFFFU));

    if (ep_idx == 0U) {
        g_ch32h417_usbfs_diag.ep0_out++;
        g_ch32h417_usbfs_diag.last_rx_len = rx_len;
    }

    if ((ep_idx != 0U) && ((USBFSD->INT_ST & USBFS_UIS_TOG_OK) == 0U)) {
        usbfs_ep_prime_out(ep_idx);
        return;
    }

    if ((ep->xfer_buf != RT_NULL) && (rx_len != 0U)) {
        /*
         * xfer_len is already the number of bytes still outstanding.  The
         * old expression subtracted actual_xfer_len a second time, so a
         * multi-packet read terminated after roughly half its requested
         * length (a 1024-byte read completed after 512 bytes).
         */
        uint32_t room = ep->xfer_len;
        if (rx_len > room) {
            rx_len = room;
        }
        if (rx_len != 0U) {
            usbfs_trace_mark(CH32H417_USBFS_TRACE_OUT_COPY_BEGIN, rx_len);
            memcpy(ep->xfer_buf + ep->actual_xfer_len,
                   (ep_idx == 0U) ? usbfs_ep0_buffer : usbfs_ep_rx_buffer[ep_idx],
                   rx_len);
            usbfs_trace_mark(CH32H417_USBFS_TRACE_OUT_COPY_END, rx_len);
        }
    }

    ep->actual_xfer_len += rx_len;
    if (ep->xfer_len >= rx_len) {
        ep->xfer_len -= rx_len;
    } else {
        ep->xfer_len = 0U;
    }

    if (ep_idx == 0U) {
        ep->ep_toggle ^= 1U;
    }

    if ((ep->xfer_len == 0U) || (rx_len < ep->ep_mps)) {
        if (ep_idx == 0U) {
            usbd_event_ep_out_complete_handler(busid, USB_CONTROL_OUT_EP0, ep->actual_xfer_len);
        } else {
            *usbfs_ep_rx_ctrl_reg(ep_idx) =
                (uint8_t)((*usbfs_ep_rx_ctrl_reg(ep_idx) & ~USBFS_UEP_R_RES_MASK) | USBFS_UEP_R_AUTO_TOG | USBFS_UEP_R_RES_NAK);
            usbfs_trace_mark(CH32H417_USBFS_TRACE_OUT_CALLBACK_BEGIN,
                             ep->actual_xfer_len);
            usbd_event_ep_out_complete_handler(busid, ep_idx, ep->actual_xfer_len);
            usbfs_trace_mark(CH32H417_USBFS_TRACE_OUT_CALLBACK_END,
                             ep->actual_xfer_len);
        }
    } else {
        usbfs_ep_prime_out(ep_idx);
    }
}

static int usbfs_clock_init(void)
{
    uint32_t timeout;

    if ((RCC->CTLR & RCC_USBHS_PLLRDY) == 0U) {
        RCC_USBHS_PLLCmd(DISABLE);
        RCC_USBHSPLLCLKConfig((RCC->CTLR & RCC_HSERDY) ? RCC_USBHSPLLSource_HSE : RCC_USBHSPLLSource_HSI);
        RCC_USBHSPLLReferConfig(RCC_USBHSPLLRefer_25M);
        RCC_USBHSPLLClockSourceDivConfig(RCC_USBHSPLL_IN_Div1);
        RCC_USBHS_PLLCmd(ENABLE);

        for (timeout = 0U; timeout < USBFS_INIT_TIMEOUT; timeout++) {
            if ((RCC->CTLR & RCC_USBHS_PLLRDY) != 0U) {
                break;
            }
        }
        if (timeout >= USBFS_INIT_TIMEOUT) {
            rt_kprintf("[USBFS] USBHS PLL ready timeout\r\n");
            return -1;
        }
    }

    RCC->CFGR2 = (RCC->CFGR2 & (uint32_t)~USBFS_CFGR2_MASK) | (uint32_t)USBFS_CFGR2_48M;
    if ((RCC->CFGR2 & USBFS_CFGR2_MASK) != USBFS_CFGR2_48M) {
        rt_kprintf("[USBFS] warning: USBFS 48M clock cfg readback failed cfgr2=0x%08x expected=0x%08x\r\n",
                   (unsigned int)RCC->CFGR2,
                   (unsigned int)USBFS_CFGR2_48M);
    }
    RCC_HBPeriphClockCmd(RCC_HBPeriph_OTG_FS, ENABLE);
    RCC_HB2PeriphClockCmd(RCC_HB2Periph_GPIOA, ENABLE);
    return 0;
}

int usb_dc_ch32h417_usbfs_init(uint8_t busid)
{
    uint8_t int_en;

    (void)busid;

    if (usbfs_clock_init() != 0) {
        return -1;
    }

    NVIC_DisableIRQ(USBFS_IRQn);
    memset(&g_ch32h417_usbfs_udc, 0, sizeof(g_ch32h417_usbfs_udc));
    g_ch32h417_usbfs_udc.port_speed = USB_SPEED_FULL;
    memset((void *)USBFS_DMA_RAM_BASE, 0, USBFS_DMA_RAM_SIZE);

    USBFSD->OTG_CR = 0U;
    USBFSD->UDEV_CTRL = 0U;
    USBFSD->INT_EN = 0U;
    USBFSD->BASE_CTRL = 0U;
    rt_thread_mdelay(120);

    USBFSH->BASE_CTRL = USBFS_UC_RESET_SIE | USBFS_UC_CLR_ALL;
    usbfs_delay(8000U);
    USBFSH->BASE_CTRL = 0U;
    USBFSD->OTG_CR = 0U;

    USBFSD->DEV_ADDR = 0U;
    USBFSD->UEP4_1_MOD = 0U;
    USBFSD->UEP2_3_MOD = 0U;
    USBFSD->UEP5_6_MOD = 0U;
    USBFSD->UEP7_MOD = 0U;
    usbfs_ep0_state_init();

    USBFSD->INT_FG = 0xffU;
    int_en = USBFS_UIE_BUS_RST | USBFS_UIE_TRANSFER;
#if USBFS_ENABLE_SUSPEND_IRQ
    int_en |= USBFS_UIE_SUSPEND;
#endif
    USBFSD->INT_EN = int_en;
    USBFSD->BASE_CTRL = USBFS_UC_DEV_PU_EN | USBFS_UC_INT_BUSY | USBFS_UC_DMA_EN;
    USBFSD->UDEV_CTRL = USBFS_UD_PD_DIS | USBFS_UD_PORT_EN;

    NVIC_SetPriority(USBFS_IRQn, USBFS_IRQ_PRIORITY);
    NVIC_EnableIRQ(USBFS_IRQn);

    rt_kprintf("[USBFS] device init done bc=0x%02x uc=0x%02x ie=0x%02x fg=0x%02x ms=0x%02x otg=0x%08x/0x%08x dma=%08x/%08x rctl=0x%08x cfgr2=0x%08x pcfg=0x%08x irq=%u/%u\r\n",
               (unsigned int)USBFSD->BASE_CTRL,
               (unsigned int)USBFSD->UDEV_CTRL,
               (unsigned int)USBFSD->INT_EN,
               (unsigned int)USBFSD->INT_FG,
               (unsigned int)USBFSD->MIS_ST,
               (unsigned int)USBFSD->OTG_CR,
               (unsigned int)USBFSD->OTG_SR,
               (unsigned int)USBFS_DMA_RAM_BASE,
               (unsigned int)USBFSD->UEP0_DMA,
               (unsigned int)RCC->CTLR,
               (unsigned int)RCC->CFGR2,
               (unsigned int)RCC->PLLCFGR,
               (unsigned int)usbfs_irq_is_enabled(USBFS_IRQn),
               (unsigned int)usbfs_irq_is_pending(USBFS_IRQn));
    return 0;
}

int usb_dc_ch32h417_usbfs_deinit(uint8_t busid)
{
    (void)busid;

    NVIC_DisableIRQ(USBFS_IRQn);
    USBFSH->BASE_CTRL = USBFS_UC_RESET_SIE | USBFS_UC_CLR_ALL;
    usbfs_delay(1000U);
    USBFSD->OTG_CR = 0U;
    USBFSD->BASE_CTRL = 0U;
    RCC_HBPeriphClockCmd(RCC_HBPeriph_OTG_FS, DISABLE);
    return 0;
}

