dasdasd12/hardware/firmware/h417/v5f_rtthread/rt-thread/components/drivers/usb/cherryusb/port/ch32h417/usb_dc_ch32h417_usbfs.c
int usb_dc_ch32h417_usbfs_set_address(uint8_t busid, uint8_t addr)
{
    (void)busid;
    g_ch32h417_usbfs_udc.dev_addr = addr;
    g_ch32h417_usbfs_udc.addr_pending = 1U;
    g_ch32h417_usbfs_diag.set_addr++;
    g_ch32h417_usbfs_diag.last_addr = addr;
    return 0;
}

int usb_dc_ch32h417_usbfs_set_remote_wakeup(uint8_t busid)
{
    (void)busid;
    return -1;
}

uint8_t usb_dc_ch32h417_usbfs_get_port_speed(uint8_t busid)
{
    (void)busid;
    return USB_SPEED_FULL;
}

int usb_dc_ch32h417_usbfs_ep_open(uint8_t busid, const struct usb_endpoint_descriptor *ep)
{
    uint8_t ep_idx = USB_EP_GET_IDX(ep->bEndpointAddress);
    uint16_t ep_mps = USB_GET_MAXPACKETSIZE(ep->wMaxPacketSize);
    uint8_t ep_type = USB_GET_ENDPOINT_TYPE(ep->bmAttributes);

    (void)busid;

    if (ep_idx >= USB_CH32H417_MAX_EP_NUM) {
        return -1;
    }

    if (ep_idx == 0U) {
        usbfs_ep0_state_init();
        return 0;
    }

    if ((ep_mps == 0U) || (ep_mps > USBFS_EP_BUFFER_SIZE)) {
        ep_mps = USBFS_EP_BUFFER_SIZE;
    }

    if (USB_EP_DIR_IS_OUT(ep->bEndpointAddress)) {
        g_ch32h417_usbfs_udc.out_ep[ep_idx].ep_mps = ep_mps;
        g_ch32h417_usbfs_udc.out_ep[ep_idx].ep_type = ep_type;
        g_ch32h417_usbfs_udc.out_ep[ep_idx].ep_enabled = 1U;
        g_ch32h417_usbfs_udc.out_ep[ep_idx].ep_stalled = 0U;
        *usbfs_ep_dma_reg(ep_idx) = (uint32_t)usbfs_ep_rx_buffer[ep_idx];
        *usbfs_ep_rx_ctrl_reg(ep_idx) = USBFS_UEP_R_AUTO_TOG | USBFS_UEP_R_RES_NAK;
        usbfs_ep_mod_update(ep_idx, 0U, 1U);
    } else {
        g_ch32h417_usbfs_udc.in_ep[ep_idx].ep_mps = ep_mps;
        g_ch32h417_usbfs_udc.in_ep[ep_idx].ep_type = ep_type;
        g_ch32h417_usbfs_udc.in_ep[ep_idx].ep_enabled = 1U;
        g_ch32h417_usbfs_udc.in_ep[ep_idx].ep_stalled = 0U;
        *usbfs_ep_dma_reg(ep_idx) = (uint32_t)usbfs_ep_tx_buffer[ep_idx];
        *usbfs_ep_tx_len_reg(ep_idx) = 0U;
        *usbfs_ep_tx_ctrl_reg(ep_idx) = USBFS_UEP_T_AUTO_TOG | USBFS_UEP_T_RES_NAK;
        usbfs_ep_mod_update(ep_idx, 1U, 1U);
    }

    return 0;
}

int usb_dc_ch32h417_usbfs_ep_close(uint8_t busid, uint8_t ep)
{
    uint8_t ep_idx = USB_EP_GET_IDX(ep);

    (void)busid;

    if (ep_idx >= USB_CH32H417_MAX_EP_NUM) {
        return -1;
    }

    if (ep_idx == 0U) {
        g_ch32h417_usbfs_udc.in_ep[0].ep_enabled = 0U;
        g_ch32h417_usbfs_udc.out_ep[0].ep_enabled = 0U;
    } else if (USB_EP_DIR_IS_OUT(ep)) {
        g_ch32h417_usbfs_udc.out_ep[ep_idx].ep_enabled = 0U;
        usbfs_ep_mod_update(ep_idx, 0U, 0U);
    } else {
        g_ch32h417_usbfs_udc.in_ep[ep_idx].ep_enabled = 0U;
        usbfs_ep_mod_update(ep_idx, 1U, 0U);
    }

    return 0;
}

int usb_dc_ch32h417_usbfs_set_stall(uint8_t busid, uint8_t ep)
{
    uint8_t ep_idx = USB_EP_GET_IDX(ep);

    (void)busid;

    if (ep_idx >= USB_CH32H417_MAX_EP_NUM) {
        return -1;
    }

    if (ep_idx == 0U) {
        USBFSD->UEP0_TX_CTRL = USBFS_UEP_T_RES_STALL;
        USBFSD->UEP0_RX_CTRL = USBFS_UEP_R_RES_STALL;
        g_ch32h417_usbfs_udc.in_ep[0].ep_stalled = 1U;
        g_ch32h417_usbfs_udc.out_ep[0].ep_stalled = 1U;
        g_ch32h417_usbfs_diag.stall++;
    } else if (USB_EP_DIR_IS_OUT(ep)) {
        *usbfs_ep_rx_ctrl_reg(ep_idx) =
            (uint8_t)((*usbfs_ep_rx_ctrl_reg(ep_idx) & ~USBFS_UEP_R_RES_MASK) | USBFS_UEP_R_AUTO_TOG | USBFS_UEP_R_RES_STALL);
        g_ch32h417_usbfs_udc.out_ep[ep_idx].ep_stalled = 1U;
    } else {
        *usbfs_ep_tx_ctrl_reg(ep_idx) =
            (uint8_t)((*usbfs_ep_tx_ctrl_reg(ep_idx) & ~USBFS_UEP_T_RES_MASK) | USBFS_UEP_T_AUTO_TOG | USBFS_UEP_T_RES_STALL);
        g_ch32h417_usbfs_udc.in_ep[ep_idx].ep_stalled = 1U;
    }

    return 0;
}

int usb_dc_ch32h417_usbfs_clear_stall(uint8_t busid, uint8_t ep)
{
    uint8_t ep_idx = USB_EP_GET_IDX(ep);

    (void)busid;

    if (ep_idx >= USB_CH32H417_MAX_EP_NUM) {
        return -1;
    }

    if (ep_idx == 0U) {
        USBFSD->UEP0_TX_CTRL = USBFS_UEP_T_RES_NAK;
        USBFSD->UEP0_RX_CTRL = USBFS_UEP_R_RES_ACK;
        g_ch32h417_usbfs_udc.in_ep[0].ep_stalled = 0U;
        g_ch32h417_usbfs_udc.out_ep[0].ep_stalled = 0U;
        g_ch32h417_usbfs_udc.in_ep[0].ep_toggle = 0U;
        g_ch32h417_usbfs_udc.out_ep[0].ep_toggle = 0U;
    } else if (USB_EP_DIR_IS_OUT(ep)) {
        *usbfs_ep_rx_ctrl_reg(ep_idx) = USBFS_UEP_R_AUTO_TOG | USBFS_UEP_R_RES_ACK;
        g_ch32h417_usbfs_udc.out_ep[ep_idx].ep_stalled = 0U;
    } else {
        *usbfs_ep_tx_ctrl_reg(ep_idx) = USBFS_UEP_T_AUTO_TOG | USBFS_UEP_T_RES_NAK;
        g_ch32h417_usbfs_udc.in_ep[ep_idx].ep_stalled = 0U;
    }

    return 0;
}

int usb_dc_ch32h417_usbfs_is_stalled(uint8_t busid, uint8_t ep, uint8_t *stalled)
{
    uint8_t ep_idx = USB_EP_GET_IDX(ep);

    (void)busid;

    if ((ep_idx >= USB_CH32H417_MAX_EP_NUM) || (stalled == RT_NULL)) {
        return -1;
    }

    *stalled = USB_EP_DIR_IS_OUT(ep) ?
               g_ch32h417_usbfs_udc.out_ep[ep_idx].ep_stalled :
               g_ch32h417_usbfs_udc.in_ep[ep_idx].ep_stalled;
    return 0;
}

int usb_dc_ch32h417_usbfs_start_write(uint8_t busid, uint8_t ep, const uint8_t *data, uint32_t data_len)
{
    uint8_t ep_idx = USB_EP_GET_IDX(ep);
    uint32_t ep_mps;
    uint32_t send_len;

    (void)busid;

    if ((data == RT_NULL) && (data_len != 0U)) {
        return -1;
    }
    if (ep_idx >= USB_CH32H417_MAX_EP_NUM) {
        return -1;
    }

    ep_mps = g_ch32h417_usbfs_udc.in_ep[ep_idx].ep_mps;
    if (ep_mps == 0U) {
        ep_mps = USB_CH32H417_FS_EP0_MPS;
    }

    g_ch32h417_usbfs_udc.in_ep[ep_idx].xfer_buf = (uint8_t *)data;
    g_ch32h417_usbfs_udc.in_ep[ep_idx].xfer_len = data_len;
    g_ch32h417_usbfs_udc.in_ep[ep_idx].actual_xfer_len = 0U;

    send_len = (data_len > ep_mps) ? ep_mps : data_len;
    usbfs_ep_prime_in(ep_idx, data, send_len);
    return 0;
}

int usb_dc_ch32h417_usbfs_start_read(uint8_t busid, uint8_t ep, uint8_t *data, uint32_t data_len)
{
    uint8_t ep_idx = USB_EP_GET_IDX(ep);

    (void)busid;

    if ((data == RT_NULL) && (data_len != 0U)) {
        return -1;
    }
    if (ep_idx >= USB_CH32H417_MAX_EP_NUM) {
        return -1;
    }

