dasdasd12/hardware/firmware/h417/v5f_rtthread/rt-thread/components/drivers/usb/cherryusb/port/ch32h417/usb_dc_ch32h417_usbfs.c
    g_ch32h417_usbfs_udc.out_ep[ep_idx].xfer_buf = data;
    g_ch32h417_usbfs_udc.out_ep[ep_idx].xfer_len = data_len;
    g_ch32h417_usbfs_udc.out_ep[ep_idx].actual_xfer_len = 0U;
    usbfs_ep_prime_out(ep_idx);
    return 0;
}

static void usbfs_irq_handler(uint8_t busid)
{
    uint8_t intflag = USBFSD->INT_FG;
    uint8_t intst = USBFSD->INT_ST;
    uint8_t ep_idx;

    g_ch32h417_usbfs_diag.irq++;
    g_ch32h417_usbfs_diag.last_intflag = intflag;
    g_ch32h417_usbfs_diag.last_intst = intst;
    usbfs_trace_mark(CH32H417_USBFS_TRACE_HANDLER_ENTER,
                     ((uint32_t)intflag << 8U) | intst);

    if ((intflag & USBFS_UIF_TRANSFER) != 0U) {
        g_ch32h417_usbfs_diag.transfer++;
        ep_idx = (uint8_t)(intst & USBFS_UIS_ENDP_MASK);
        usbfs_trace_mark(CH32H417_USBFS_TRACE_TRANSFER,
                         ((uint32_t)ep_idx << 24U) |
                         ((uint32_t)(intst & USBFS_UIS_TOKEN_MASK) << 16U) |
                         (uint32_t)USBFSD->RX_LEN);
        g_ch32h417_usbfs_diag.last_xfer_intflag = intflag;
        g_ch32h417_usbfs_diag.last_xfer_intst = intst;
        g_ch32h417_usbfs_diag.last_xfer_ep = ep_idx;
        g_ch32h417_usbfs_diag.last_xfer_token = (uint8_t)(intst & USBFS_UIS_TOKEN_MASK);
        g_ch32h417_usbfs_diag.last_xfer_rx_len = USBFSD->RX_LEN;

        /*
         * Retire this completion before a class callback is allowed to arm
         * the endpoint again.  The old ordering cleared UIF_TRANSFER after
         * the callback.  A native-64 CDC OUT callback immediately re-arms
         * EP2, so the host could complete the next packet while the old ISR
         * was still running; the final write-one-to-clear then erased the
         * new packet's interrupt.  The visible result was an ACK/armed OUT
         * endpoint with no more callbacks until the watchdog reset V5F.
         *
         * NAK a non-control OUT endpoint first so its DMA buffer cannot be
         * overwritten while the current completion is being consumed.  A
         * continuation or callback will explicitly prime it again.
         */
        if (((intst & USBFS_UIS_TOKEN_MASK) == USBFS_UIS_TOKEN_OUT) &&
            ((intst & USBFS_UIS_IS_NAK) == 0U) &&
            (ep_idx != 0U) &&
            (ep_idx < USB_CH32H417_MAX_EP_NUM)) {
            volatile uint8_t *rx_ctrl = usbfs_ep_rx_ctrl_reg(ep_idx);
            *rx_ctrl = (uint8_t)((*rx_ctrl & ~USBFS_UEP_R_RES_MASK) |
                                 USBFS_UEP_R_AUTO_TOG |
                                 USBFS_UEP_R_RES_NAK);
        }
        usbfs_trace_mark(CH32H417_USBFS_TRACE_FLAG_CLEAR_BEGIN,
                         USBFS_UIF_TRANSFER);
        USBFSD->INT_FG = USBFS_UIF_TRANSFER;
        __asm volatile("fence iorw, iorw" ::: "memory");
        usbfs_trace_mark(CH32H417_USBFS_TRACE_FLAG_CLEAR_END,
                         USBFS_UIF_TRANSFER);

        if ((intst & USBFS_UIS_TOKEN_MASK) == USBFS_UIS_TOKEN_SETUP) {
            g_ch32h417_usbfs_diag.last_xfer_buf0 = usbfs_pack4(usbfs_ep0_buffer);
            g_ch32h417_usbfs_diag.last_xfer_buf1 = usbfs_pack4(usbfs_ep0_buffer + 4);
        }
        if (((intst & USBFS_UIS_TOKEN_MASK) == USBFS_UIS_TOKEN_SETUP) &&
            (usbfs_ep0_buffer_has_setup() != 0U)) {
            if (((intst & USBFS_UIS_IS_NAK) != 0U) || (ep_idx != 0U)) {
                g_ch32h417_usbfs_diag.setup_recovered++;
            }
            usbfs_handle_setup_packet(busid);
        } else if ((intst & USBFS_UIS_IS_NAK) != 0U) {
            g_ch32h417_usbfs_diag.transfer_nak++;
        } else if (ep_idx < USB_CH32H417_MAX_EP_NUM) {
            switch (intst & USBFS_UIS_TOKEN_MASK) {
            case USBFS_UIS_TOKEN_SETUP:
                if (ep_idx == 0U) {
                    usbfs_handle_setup_packet(busid);
                }
                break;
            case USBFS_UIS_TOKEN_IN:
                usbfs_handle_ep_in_xfer_complete(busid, ep_idx);
                break;
            case USBFS_UIS_TOKEN_OUT:
                usbfs_handle_ep_out_xfer_complete(busid, ep_idx);
                break;
            default:
                break;
            }
        } else {
            g_ch32h417_usbfs_diag.transfer_bad_ep++;
        }
    } else if ((intflag & USBFS_UIF_BUS_RST) != 0U) {
        g_ch32h417_usbfs_diag.bus_reset++;
        USBFSD->DEV_ADDR = 0U;
        USBFSD->UEP4_1_MOD = 0U;
        USBFSD->UEP2_3_MOD = 0U;
        USBFSD->UEP5_6_MOD = 0U;
        USBFSD->UEP7_MOD = 0U;
        usbfs_clear_transfer_state();
        USBFSD->INT_FG = USBFS_UIF_BUS_RST;
        usbd_event_reset_handler(busid);
    } else if ((intflag & USBFS_UIF_SUSPEND) != 0U) {
        if ((USBFSD->MIS_ST & USBFS_UMS_SUSPEND) != 0U) {
            g_ch32h417_usbfs_diag.suspend++;
            usbd_event_suspend_handler(busid);
        } else {
            g_ch32h417_usbfs_diag.resume++;
            usbd_event_resume_handler(busid);
        }
        USBFSD->INT_FG = USBFS_UIF_SUSPEND;
    } else {
        USBFSD->INT_FG = intflag;
    }
    usbfs_trace_mark(CH32H417_USBFS_TRACE_HANDLER_END, intflag);
}

void usb_dc_ch32h417_usbfs_dump_diag(void)
{
    uint32_t dma = USBFSD->UEP0_DMA;

    rt_kprintf("[USBFS diag] irq=%u rst=%u sus=%u res=%u wk=%u xfer=%u setup=%u rec=%u pIN0=%u in0=%u pOUT0=%u out0=%u stall=%u addr=%u\r\n",
               (unsigned int)g_ch32h417_usbfs_diag.irq,
               (unsigned int)g_ch32h417_usbfs_diag.bus_reset,
               (unsigned int)g_ch32h417_usbfs_diag.suspend,
               (unsigned int)g_ch32h417_usbfs_diag.resume,
               (unsigned int)g_ch32h417_usbfs_diag.wakeup_irq,
               (unsigned int)g_ch32h417_usbfs_diag.transfer,
               (unsigned int)g_ch32h417_usbfs_diag.setup,
               (unsigned int)g_ch32h417_usbfs_diag.setup_recovered,
               (unsigned int)g_ch32h417_usbfs_diag.ep0_prime_in,
               (unsigned int)g_ch32h417_usbfs_diag.ep0_in,
               (unsigned int)g_ch32h417_usbfs_diag.ep0_prime_out,
               (unsigned int)g_ch32h417_usbfs_diag.ep0_out,
               (unsigned int)g_ch32h417_usbfs_diag.stall,
               (unsigned int)g_ch32h417_usbfs_diag.last_addr);
    rt_kprintf("[USBFS diag] if=0x%02x st=0x%02x setup=%08x/%08x resp=%08x tx=%u rx=%u\r\n",
               (unsigned int)g_ch32h417_usbfs_diag.last_intflag,
               (unsigned int)g_ch32h417_usbfs_diag.last_intst,
               (unsigned int)g_ch32h417_usbfs_diag.last_setup0,
               (unsigned int)g_ch32h417_usbfs_diag.last_setup1,
               (unsigned int)g_ch32h417_usbfs_diag.last_resp0,
               (unsigned int)g_ch32h417_usbfs_diag.last_tx_len,
               (unsigned int)g_ch32h417_usbfs_diag.last_rx_len);
    rt_kprintf("[USBFS xfer] nak=%u bad=%u xif=0x%02x xst=0x%02x ep=%u tok=0x%02x xrx=%u buf=%08x/%08x\r\n",
               (unsigned int)g_ch32h417_usbfs_diag.transfer_nak,
               (unsigned int)g_ch32h417_usbfs_diag.transfer_bad_ep,
               (unsigned int)g_ch32h417_usbfs_diag.last_xfer_intflag,
               (unsigned int)g_ch32h417_usbfs_diag.last_xfer_intst,
               (unsigned int)g_ch32h417_usbfs_diag.last_xfer_ep,
               (unsigned int)g_ch32h417_usbfs_diag.last_xfer_token,
               (unsigned int)g_ch32h417_usbfs_diag.last_xfer_rx_len,
               (unsigned int)g_ch32h417_usbfs_diag.last_xfer_buf0,
               (unsigned int)g_ch32h417_usbfs_diag.last_xfer_buf1);
    rt_kprintf("[USBFS regs] bc=0x%02x uc=0x%02x ie=0x%02x fg=0x%02x ms=0x%02x da=0x%02x rxlen=%u e0t=0x%02x e0r=0x%02x dma=0x%08x\r\n",
               (unsigned int)USBFSD->BASE_CTRL,
               (unsigned int)USBFSD->UDEV_CTRL,
               (unsigned int)USBFSD->INT_EN,
               (unsigned int)USBFSD->INT_FG,
               (unsigned int)USBFSD->MIS_ST,
               (unsigned int)USBFSD->DEV_ADDR,
               (unsigned int)USBFSD->RX_LEN,
               (unsigned int)USBFSD->UEP0_TX_CTRL,
               (unsigned int)USBFSD->UEP0_RX_CTRL,
               (unsigned int)dma);
    rt_kprintf("[USBFS regs2] otg=0x%08x/0x%08x rctl=0x%08x cfgr2=0x%08x pll2=0x%08x hb=0x%08x irq=%u/%u/%u w=%u/%u/%u\r\n",
               (unsigned int)USBFSD->OTG_CR,
               (unsigned int)USBFSD->OTG_SR,
               (unsigned int)RCC->CTLR,
               (unsigned int)RCC->CFGR2,
               (unsigned int)RCC->PLLCFGR2,
               (unsigned int)RCC->HBPCENR,
               (unsigned int)usbfs_irq_is_enabled(USBFS_IRQn),
               (unsigned int)usbfs_irq_is_pending(USBFS_IRQn),
               (unsigned int)usbfs_irq_is_active(USBFS_IRQn),
               (unsigned int)usbfs_irq_is_enabled(USBFSWakeUp_IRQn),
               (unsigned int)usbfs_irq_is_pending(USBFSWakeUp_IRQn),
               (unsigned int)usbfs_irq_is_active(USBFSWakeUp_IRQn));
}

void USBFS_IRQHandler(void)
    __attribute__((interrupt("WCH-Interrupt-fast"), aligned(16)));
void USBFS_IRQHandler(void)
{
    GET_INT_SP();
    usbfs_trace_irq_begin();
    rt_interrupt_enter();
    usbfs_trace_mark(CH32H417_USBFS_TRACE_RT_ENTERED, 0U);
    usbfs_irq_handler(USB_CH32H417_BUS_FS);
#if APP_USBFS_STREAM_DIAG
    usbfs_rt_interrupt_leave_traced();
#else
    usbfs_trace_mark(CH32H417_USBFS_TRACE_RT_LEAVE_BEGIN,
                     (uint32_t)rt_interrupt_nest);
    rt_interrupt_leave();
    usbfs_trace_mark(CH32H417_USBFS_TRACE_RT_LEAVE_END,
                     (uint32_t)rt_interrupt_nest);
#endif
    FREE_INT_SP();
}

void USBFSWakeup_IRQHandler(void) __attribute__((interrupt("WCH-Interrupt-fast")));
void USBFSWakeup_IRQHandler(void)
{
    GET_INT_SP();
    rt_interrupt_enter();
    g_ch32h417_usbfs_diag.wakeup_irq++;
    USBFSD->INT_FG = USBFS_UIF_SUSPEND;
    rt_interrupt_leave();
    FREE_INT_SP();
}
